Revit 2027 API
RebarConstrainedHandle.AllowsConstraintToSurface Method
 Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToSurface] type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowsConstraintToSurface()
Public Function AllowsConstraintToSurface As Boolean
public:
bool AllowsConstraintToSurface()
member AllowsConstraintToSurface : unit -> bool
Return Value
Boolean
 Returns true if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToSurface] type.
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace